CSI API ETABS v1
cDesignConcrete.GetSummaryResultsJoint Method
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetSummaryResultsJoint(
	string Name,
	ref int NumberItems,
	ref string[] FrameName,
	ref string[] LCJSRatioMajor,
	ref double[] JSRatioMajor,
	ref string[] LCJSRatioMinor,
	ref double[] JSRatioMinor,
	ref string[] LCBCCRatioMajor,
	ref double[] BCCRatioMajor,
	ref string[] LCBCCRatioMinor,
	ref double[] BCCRatioMinor,
	ref string[] ErrorSummary,
	ref string[] WarningSummary,
	eItemType ItemType = eItemType.Objects
)
Function GetSummaryResultsJoint (
	Name As String,
	ByRef NumberItems As Integer,
	ByRef FrameName As String(),
	ByRef LCJSRatioMajor As String(),
	ByRef JSRatioMajor As Double(),
	ByRef LCJSRatioMinor As String(),
	ByRef JSRatioMinor As Double(),
	ByRef LCBCCRatioMajor As String(),
	ByRef BCCRatioMajor As Double(),
	ByRef LCBCCRatioMinor As String(),
	ByRef BCCRatioMinor As Double(),
	ByRef ErrorSummary As String(),
	ByRef WarningSummary As String(),
	Optional ItemType As eItemType = eItemType.Objects
) As Integer
Dim instance As cDesignConcrete
Dim Name As String
Dim NumberItems As Integer
Dim FrameName As String()
Dim LCJSRatioMajor As String()
Dim JSRatioMajor As Double()
Dim LCJSRatioMinor As String()
Dim JSRatioMinor As Double()
Dim LCBCCRatioMajor As String()
Dim BCCRatioMajor As Double()
Dim LCBCCRatioMinor As String()
Dim BCCRatioMinor As Double()
Dim ErrorSummary As String()
Dim WarningSummary As String()
Dim ItemType As eItemType
Dim returnValue As Integer
returnValue = instance.GetSummaryResultsJoint(Name,
	NumberItems, FrameName, LCJSRatioMajor,
	JSRatioMajor, LCJSRatioMinor, JSRatioMinor,
	LCBCCRatioMajor, BCCRatioMajor,
	LCBCCRatioMinor, BCCRatioMinor,
	ErrorSummary, WarningSummary, ItemType)
int GetSummaryResultsJoint(
	String^ Name,
	int% NumberItems,
	array<String^>^% FrameName,
	array<String^>^% LCJSRatioMajor,
	array<double>^% JSRatioMajor,
	array<String^>^% LCJSRatioMinor,
	array<double>^% JSRatioMinor,
	array<String^>^% LCBCCRatioMajor,
	array<double>^% BCCRatioMajor,
	array<String^>^% LCBCCRatioMinor,
	array<double>^% BCCRatioMinor,
	array<String^>^% ErrorSummary,
	array<String^>^% WarningSummary,
	eItemType ItemType = eItemType::Objects
)
abstract GetSummaryResultsJoint :
        Name : string *
        NumberItems : int byref *
        FrameName : string[] byref *
        LCJSRatioMajor : string[] byref *
        JSRatioMajor : float[] byref *
        LCJSRatioMinor : string[] byref *
        JSRatioMinor : float[] byref *
        LCBCCRatioMajor : string[] byref *
        BCCRatioMajor : float[] byref *
        LCBCCRatioMinor : string[] byref *
        BCCRatioMinor : float[] byref *
        ErrorSummary : string[] byref *
        WarningSummary : string[] byref *
        ?ItemType : eItemType
(* Defaults:
        let _ItemType = defaultArg ItemType eItemType.Objects
*)
-> int
Parameters
Name
Type: System.String
NumberItems
Type: System.Int32
FrameName
Type: System.String[]
LCJSRatioMajor
Type: System.String[]
JSRatioMajor
Type: System.Double[]
LCJSRatioMinor
Type: System.String[]
JSRatioMinor
Type: System.Double[]
LCBCCRatioMajor
Type: System.String[]
BCCRatioMajor
Type: System.Double[]
LCBCCRatioMinor
Type: System.String[]
BCCRatioMinor
Type: System.Double[]
ErrorSummary
Type: System.String[]
WarningSummary
Type: System.String[]
ItemType (Optional)
Type: ETABSv1.eItemType
Return Value
Type: Int32
See Also
Reference
cDesignConcrete Interface
ETABSv1 Namespace